CREATE TABLE [Project].[Purpose]
(
	[ИДПроекта] UNIQUEIDENTIFIER,
	[ИдентификаторНазначения] uniqueidentifier,
	[ФактическаяДатаОкончанияНазначения] datetime,
	[ФактическаяДатаНачалаНазначения] datetime,
	[ДатаСозданияНазначения] datetime,
	[СчетчикСозданныхВерсийНазначения] int,
	[ДатаОкончанияНазначения] datetime,
	[НазначениеСПревышениемДоступности] bit,
	[НазначениеОпубликовано] bit,
	[ДатаИзмененияНазначения] datetime,
	[СчетчикИзмененныхВерсийНазначения] int,
	[ПиковыеЕдиницыНазначения] float,
	[ПроцентЗавершенияНазначенияПоТрудозатратам] int,
	[ТипРесурсаНазначения] int,
	[ДатаНачалаНазначения] datetime,
	[ОтклонениеНачалаНазначения] float,
	[ТипНазначения] int,
	[Отклонение_по_трудозатратам_задачи] float,
	[ЯвляетсяОбщей] bit,
	[ИмяПроекта] nvarchar(max),
	[ИдентификаторРесурса] uniqueidentifier,
	[НазваниеРесурса] nvarchar(max),
	[ИдентификаторЗадачи] uniqueidentifier,
	[Отделыресурсов_Р] nvarchar(max),
	[Роль_Р] nvarchar(max),
	[Кодпідрозділу_Р] float,
	[КодКРІ_З] nvarchar(max),
	[поплану_З] float


)
